miscellaneous.org
#+HTML_HEAD: <meta charset="utf-8">
#+HTML_HEAD: <meta name="viewport" content="width=device-width, initial-scale=1.0, shrink-to-fit=no">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="others.css">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="common.css">
#+HTML_HEAD: <script src="misc.js"></script>
#+OPTIONS: toc:nil num:nil html-postamble:nil title:nil
#+TITLE: Miscellaneous

#+html: <nav>
[[file:index.html][Home]] | [[file:ai-cogsci.html][AI and CogSci]] | [[file:common-lisp-and-emacs.html][Common Lisp and Emacs]] | *MISCELLANEOUS*
#+html: </nav>

-----

I sometimes wish to write on topics that I'm just familiar with. But as soon as I sit down to write, I realize that while I may have spent a few days reading about a topic, there are others who spend their entire careers reading and learning about them. Simply sharing any interesting articles I come across seems to have a much higher utility for everyone involved. Below, I am maintaining such a list.

#+begin_center
/Any article on health and medicine is not a substitute for consulting your own medical provider./ 
#+end_center

* On This Page
:PROPERTIES:
:TOC:      :include all :depth 1 :ignore this
:CUSTOM_ID: on-this-page
:END:

:CONTENTS:
- [[#articles][Articles]]
- [[#books][Books]]
- [[#blogs][Blogs]]
:END:

* Articles
:PROPERTIES:
:CUSTOM_ID: articles
:END:

** Random
:PROPERTIES:
:CUSTOM_ID: random :ignore this
:END:

Note: This excludes Books and Blogs.

#+HTML: <button id="show-random-articles">Show Random Articles</button>

#+begin_random-articles
Please enable javascript to see a random listing of articles from below.
#+end_random-articles

** Android
:PROPERTIES:
:CUSTOM_ID: android
:END:

- [[https://human9being9.wordpress.com/2020/03/30/apps-for-android-tablets/][Apps for Android Tablets - human9being9]]
- [[https://www.reddit.com/r/GalaxyTab/comments/1cez6d3/using_samsung_taskbar_with_nova_or_other_third/][Using Samsung Taskbar with Nova or other third party launchers - reddit]]
- [[https://www.reddit.com/r/emacs/comments/111ki1e/comment/jucysgq/?utm_source=share&utm_medium=web2x&context=3][Termux and Emacs on Android - reddit]]
  - [[https://github.com/termux/proot-distro][PRoot Distro - Utility for managing installations of the Linux distributions in Termux]]
  - [[https://sourceforge.net/projects/android-ports-for-gnu-emacs/files/termux/][Android Ports for GNU Emacs Files - sourceforge]]
- [[https://github.com/EXALAB/AnLinux-App][AnLinux - Run Linux on Android without root]]
- [[https://f-droid.org/][F-Droid]]

** Career Options
:PROPERTIES:
:CUSTOM_ID: career-options
:END:

- [[https://www.youtube.com/watch?v=CkwSeMrOPjc][The Comprehensive Map of Medicine]]
- [[http://www.csfieldguide.org.nz/en/index.html][Computer Science Field Guide]]
- [[https://www.grc.nasa.gov/WWW/k-12/airplane/][Beginner's Guide to Aeronautics]]
- [[https://www.youtube.com/watch?v=pQgxiQAMTTo][The Map of Engineering]]

** Climate Change
:PROPERTIES:
:CUSTOM_ID: climate-change
:END:

- [[https://news.cornell.edu/stories/1997/08/us-could-feed-800-million-people-grain-livestock-eat?fbclid=IwZXh0bgNhZW0CMTEAAR2yM83FdV7_YPBj7V2bAiJFHTTEDzoGN-EFzZtk1pAGYl49SvQVOYuWBkM_aem_ASS7GBDwOG2nqI3uPqqN14Y_nDAfTyxccNC6tQNCJ2U6iCp3Dvl64YIY3kbhDZXFe2KRlGIIusbyUY_nYuBmp3JN][U.S. could feed 800 million people with grain that livestock eat, Cornell ecologist advises animal scientists - Cornell Chronicle]]
- [[https://www.theguardian.com/environment/ng-interactive/2019/jul/19/carbon-calculator-how-taking-one-flight-emits-as-much-as-many-people-do-in-a-year][How your flight emits as much CO2 as many people do in a year - The Guardian]]
- [[https://usfblogs.usfca.edu/sustainability/2023/04/20/overconsumption-not-overpopulation-debunking-the-overpopulation-myth-and-eco-fascism/#:~:text=This%20idea%20is%20based%20on,same%20amount%20of%20fossil%20fuels.][Overconsumption, not Overpopulation: Debunking the Overpopulation Myth and Eco-Fascism]]

** Common Lisp
:PROPERTIES:
:CUSTOM_ID: common-lisp
:END:

- [[https://lispcookbook.github.io/cl-cookbook/][The Common Lisp Cookbook]]
- [[https://www.quora.com/What-is-your-favourite-non-mainstream-programming-language/answer/Shubhamkar-Ayare?ch=10&share=3d935d6a&srid=tWo7][Why Common Lisp]]
- [[http://www.cs.cmu.edu/~dst/LispBook/][Common Lisp: A Gentle Introduction to Symbolic Computing]]
- [[https://human9being9.wordpress.com/cs-se-aic/common-lisp-for-programmers/][Common Lisp for Programmers]]
- [[https://github.com/lisp-maintainers/cl-repl][cl-repl - A colorful REPL for Common Lisp]]
- [[https://github.com/nobody-famous/alive/][Alive - Common Lisp extension for VS Code]]
- [[https://github.com/Enerccio/SLT][SLT - Common Lisp Language Plugin for Jetbrains IDE lineup]]
- [[https://cl-community-spec.github.io/pages/index.html][CL Community Spec]]
- [[https://novaspec.org/][Novaspec]]

** Computer Science
:PROPERTIES:
:CUSTOM_ID: computer-science
:END:

- [[https://teachyourselfcs.com/][Teach Yourself Computer Science]]
- [[http://www.csfieldguide.org.nz/en/index.html][Computer Science Field Guide]]
- [[https://varunshenoy.substack.com/p/dont-major-in-computer-science][Don't Major in Computer Science - Varun Shenoy]]
  
** Emacs
:PROPERTIES:
:CUSTOM_ID: emacs
:END:

- [[https://github.com/corvideon/mousemacs][mousemacs]] - An Emacs setup without the idiosyncrasies of Emacs key bindings. Suitable for users of VS Code or other "modern" development environments.
- [[https://github.com/org-roam/org-roam][org-roam - Plain-text Knowledge Management System]]
- [[https://github.com/org-roam/org-roam-ui][org-roam-ui - A graphical frontend for exploring your org-roam Zettelkasten]]
** Growing Up
:PROPERTIES:
:CUSTOM_ID: growing-up
:END:

- [[https://kidshealth.org/en/teens/][Resources for Teens - KidsHealth]]
- [[https://www.psychologytoday.com/us/blog/fulfillment-any-age/201207/bragging-when-is-it-ok-and-when-is-it-not-ok][Bragging: When Is It OK and When Is It Not OK? - Psychology Today]]
- [[https://www.quora.com/What-is-the-difference-between-introversion-and-social-anxiety][The Difference Between Introversion and Social Anxiety]]
- [[https://www.youtube.com/watch?v=ESqfW_kyZq8][Validation, Communication through Empathy]]
- [[https://writingcenter.unc.edu/tips-and-tools/fallacies/][Fallacies - This handout discusses common logical fallacies that you may encounter in your own writing or the writing of others.]]

