miscellaneous.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-07 Tue 10:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Miscellaneous</title>
<meta name="author" content="shubhamkar" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, shrink-to-fit=no">
<link rel="stylesheet" type="text/css" href="others.css">
<link rel="stylesheet" type="text/css" href="common.css">

<link rel='stylesheet' href='styles.css'>
<link rel='stylesheet' type='text/css' href='https://fonts.googleapis.com/css?family=Droid+Sans' />
</head>
<body>
<div id="content" class="content">
<nav>
<p>
<a href="index.html">Home</a> | <a href="ai-cogsci.html">AI and CogSci</a> | <a href="common-lisp-and-emacs.html">Common Lisp and Emacs</a> | <b>MISCELLANEOUS</b>
</p>
</nav>

<hr />

<p>
I sometimes wish to write on topics that I'm just familiar with. But as soon as I sit down to write, I realize that while I may have spent a few days reading about a topic, there are others who spend their entire careers reading and learning about them. Simply sharing any interesting articles I come across seems to have a much higher utility for everyone involved. Below, I am maintaining such a list.
</p>

<div class="org-center">
<p>
<i>Any article on health and medicine is not a substitute for consulting your own medical provider.</i> 
</p>
</div>

<div id="outline-container-on-this-page" class="outline-2">
<h2 id="on-this-page">On This Page</h2>
<div class="outline-text-2" id="text-on-this-page">
<ul class="org-ul">
<li><a href="#articles">Articles</a></li>
<li><a href="#books">Books</a></li>
<li><a href="#blogs">Blogs</a></li>
</ul>
</div>
</div>

<div id="outline-container-articles" class="outline-2">
<h2 id="articles">Articles</h2>
<div class="outline-text-2" id="text-articles">
</div>

<div id="outline-container-random :ignore this" class="outline-3">
<h3 id="random :ignore this">Random</h3>
<div class="outline-text-3" id="text-random :ignore this">
<p>
Note: This excludes Books and Blogs.
</p>

<button id="show-random-articles">Show Random Articles</button>

<div class="random-articles" id="orgda2d79e">
<p>
Please enable javascript to see a random listing of articles from below.
</p>

</div>
</div>
</div>

<div id="outline-container-android" class="outline-3">
<h3 id="android">Android</h3>
<div class="outline-text-3" id="text-android">
<ul class="org-ul">
<li><a href="https://human9being9.wordpress.com/2020/03/30/apps-for-android-tablets/">Apps for Android Tablets - human9being9</a></li>
<li><a href="https://www.reddit.com/r/GalaxyTab/comments/1cez6d3/using_samsung_taskbar_with_nova_or_other_third/">Using Samsung Taskbar with Nova or other third party launchers - reddit</a></li>
<li><a href="https://www.reddit.com/r/emacs/comments/111ki1e/comment/jucysgq/?utm_source=share&amp;utm_medium=web2x&amp;context=3">Termux and Emacs on Android - reddit</a>
<ul class="org-ul">
<li><a href="https://sourceforge.net/projects/android-ports-for-gnu-emacs/files/termux/">Android Ports for GNU Emacs Files - sourceforge</a></li>
</ul></li>
<li><a href="https://github.com/EXALAB/AnLinux-App">AnLinux - Run Linux on Android without root</a></li>
<li><a href="https://f-droid.org/">F-Droid</a></li>
</ul>
</div>
</div>

<div id="outline-container-career-options" class="outline-3">
<h3 id="career-options">Career Options</h3>
<div class="outline-text-3" id="text-career-options">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=CkwSeMrOPjc">The Comprehensive Map of Medicine</a></li>
<li><a href="http://www.csfieldguide.org.nz/en/index.html">Computer Science Field Guide</a></li>
<li><a href="https://www.grc.nasa.gov/WWW/k-12/airplane/">Beginner's Guide to Aeronautics</a></li>
<li><a href="https://www.youtube.com/watch?v=pQgxiQAMTTo">The Map of Engineering</a></li>
</ul>
</div>
</div>

<div id="outline-container-climate-change" class="outline-3">
<h3 id="climate-change">Climate Change</h3>
<div class="outline-text-3" id="text-climate-change">
<ul class="org-ul">
<li><a href="https://news.cornell.edu/stories/1997/08/us-could-feed-800-million-people-grain-livestock-eat?fbclid=IwZXh0bgNhZW0CMTEAAR2yM83FdV7_YPBj7V2bAiJFHTTEDzoGN-EFzZtk1pAGYl49SvQVOYuWBkM_aem_ASS7GBDwOG2nqI3uPqqN14Y_nDAfTyxccNC6tQNCJ2U6iCp3Dvl64YIY3kbhDZXFe2KRlGIIusbyUY_nYuBmp3JN">U.S. could feed 800 million people with grain that livestock eat, Cornell ecologist advises animal scientists - Cornell Chronicle</a></li>
<li><a href="https://www.theguardian.com/environment/ng-interactive/2019/jul/19/carbon-calculator-how-taking-one-flight-emits-as-much-as-many-people-do-in-a-year">How your flight emits as much CO2 as many people do in a year - The Guardian</a></li>
<li><a href="https://usfblogs.usfca.edu/sustainability/2023/04/20/overconsumption-not-overpopulation-debunking-the-overpopulation-myth-and-eco-fascism/#:~:text=This%20idea%20is%20based%20on,same%20amount%20of%20fossil%20fuels.">Overconsumption, not Overpopulation: Debunking the Overpopulation Myth and Eco-Fascism</a></li>
</ul>
</div>
</div>

<div id="outline-container-common-lisp" class="outline-3">
<h3 id="common-lisp">Common Lisp</h3>
<div class="outline-text-3" id="text-common-lisp">
<ul class="org-ul">
<li><a href="https://lispcookbook.github.io/cl-cookbook/">The Common Lisp Cookbook</a></li>
<li><a href="https://www.quora.com/What-is-your-favourite-non-mainstream-programming-language/answer/Shubhamkar-Ayare?ch=10&amp;share=3d935d6a&amp;srid=tWo7">Why Common Lisp</a></li>
<li><a href="http://www.cs.cmu.edu/~dst/LispBook/">Common Lisp: A Gentle Introduction to Symbolic Computing</a></li>
<li><a href="https://human9being9.wordpress.com/cs-se-aic/common-lisp-for-programmers/">Common Lisp for Programmers</a></li>
<li><a href="https://github.com/lisp-maintainers/cl-repl">cl-repl - A colorful REPL for Common Lisp</a></li>
<li><a href="https://github.com/nobody-famous/alive/">Alive - Common Lisp extension for VS Code</a></li>
<li><a href="https://github.com/Enerccio/SLT">SLT - Common Lisp Language Plugin for Jetbrains IDE lineup</a></li>
<li><a href="https://cl-community-spec.github.io/pages/index.html">CL Community Spec</a></li>
<li><a href="https://novaspec.org/">Novaspec</a></li>
</ul>
</div>
</div>

<div id="outline-container-computer-science" class="outline-3">
<h3 id="computer-science">Computer Science</h3>
<div class="outline-text-3" id="text-computer-science">
<ul class="org-ul">
<li><a href="https://teachyourselfcs.com/">Teach Yourself Computer Science</a></li>
<li><a href="http://www.csfieldguide.org.nz/en/index.html">Computer Science Field Guide</a></li>
<li><a href="https://varunshenoy.substack.com/p/dont-major-in-computer-science">Don't Major in Computer Science - Varun Shenoy</a></li>
</ul>
</div>
</div>

<div id="outline-container-emacs" class="outline-3">
<h3 id="emacs">Emacs</h3>
<div class="outline-text-3" id="text-emacs">
<ul class="org-ul">
<li><a href="https://github.com/corvideon/mousemacs">mousemacs</a> - An Emacs setup without the idiosyncrasies of Emacs key bindings. Suitable for users of VS Code or other "modern" development environments.</li>
<li><a href="https://github.com/org-roam/org-roam">org-roam - Plain-text Knowledge Management System</a></li>
<li><a href="https://github.com/org-roam/org-roam-ui">org-roam-ui - A graphical frontend for exploring your org-roam Zettelkasten</a></li>
</ul>
</div>
</div>
<div id="outline-container-growing-up" class="outline-3">
<h3 id="growing-up">Growing Up</h3>
<div class="outline-text-3" id="text-growing-up">
<ul class="org-ul">
<li><a href="https://kidshealth.org/en/teens/">Resources for Teens - KidsHealth</a></li>
<li><a href="https://www.psychologytoday.com/us/blog/fulfillment-any-age/201207/bragging-when-is-it-ok-and-when-is-it-not-ok">Bragging: When Is It OK and When Is It Not OK? - Psychology Today</a></li>
<li><a href="https://www.quora.com/What-is-the-difference-between-introversion-and-social-anxiety">The Difference Between Introversion and Social Anxiety</a></li>
<li><a href="https://www.youtube.com/watch?v=ESqfW_kyZq8">Validation, Communication through Empathy</a></li>
<li><a href="https://writingcenter.unc.edu/tips-and-tools/fallacies/">Fallacies - This handout discusses common logical fallacies that you may encounter in your own writing or the writing of others.</a></li>
</ul>
</div>
</div>
