miscellaneous.org
** JEE
:PROPERTIES:
:CUSTOM_ID: jee
:END:

- [[https://human9being9.wordpress.com/how-to-prepare-for-iit-jee-from-class-6-7-or-8/][How to Prepare for IIT JEE from class 6, 7 or 8?]]
- [[https://human9being9.wordpress.com/how-to-prepare-for-iit-jee-from-class-11-without-coaching/][How to prepare for IIT JEE from class 11th without coaching?]]
- [[https://human9being9.wordpress.com/jee-advanced-unsolved-papers-2013-2016/][IIT JEE / JEE (Advanced) Unsolved Papers (2008-2017)]]

** Life
:PROPERTIES:
:CUSTOM_ID: life
:END:

- [[https://www.cfa.harvard.edu/~ejchaisson/cosmic_evolution/docs/splash.html][Cosmic Evolution: From Big Bang to Humankind]]
- [[https://www.quora.com/What-is-the-most-interesting-fact-you-know-about-Understanding-Life/answer/Vandana-Thakur-99?ch=15&oid=397885467&share=ee834e2f&srid=tWo7&target_type=answer&fbclid=IwZXh0bgNhZW0CMTEAAR34WFhtf2GEQqCrB6-4EyHUvOhx8XybZIoRrLFBqF4WJPMMOsDmerzaCNY_aem_ASSxfdkyPKaZz992hGdRRu22-9-BKQnnHZ0wfigAjJ-s43REo2k_iNBFfJtQ6dcFAtjQrYC3pDsIAQKk9T6iSPIw][How much time do we have with different people in our life?]]
  - [[https://waitbutwhy.com/2015/12/the-tail-end.html][The Tail End]] - A more detailed article that conveys the same points
- [[https://zettelkasten.de/introduction/][Introduction to the Zettelkasten Method]]
  - [[https://github.com/org-roam/org-roam-ui][org-roam-ui - A graphical frontend for exploring your org-roam Zettelkasten]]
- [[https://www.youtube.com/watch?v=ESqfW_kyZq8][Validation, Communication through Empathy]]
- [[https://michaelssorensen.com/how-to-validate-someone-when-you-dont-agree-with-them/][How to validate someone when you don't agree with them?]]
- [[https://writingcenter.unc.edu/tips-and-tools/fallacies/][Fallacies - This handout discusses common logical fallacies that you may encounter in your own writing or the writing of others.]]
- [[https://betterexplained.com/articles/logical-fallacy-popularity-is-not-quality/][Logical fallacy: popularity is not quality - BetterExplained]]
- [[https://lolitafashion.fandom.com/wiki/Boystyle][Boystyle - Lolita (Rorita) Fashion Wiki]]
- [[https://www.youtube.com/watch?v=-hjGgFgnYIA&list=PL8dPuuaLjXtNppY8ZHMPDH5TKK2UpU8Ng][Crash Course - History of Science]]
- [[https://medium.com/the-mission/willpower-doesnt-work-here-s-the-key-to-being-more-productive-according-to-neuroscience-f6c4257eb6b9][Willpower Doesn’t Work. Here’s the Key to Being More Productive According to Neuroscience.]]
  - [[https://en.wikipedia.org/wiki/Implementation_intention][Implementation Intention - Wikipedia]]    

** Mental Health
:PROPERTIES:
:CUSTOM_ID: mental-health
:END:

- [[https://www.youtube.com/watch?v=ESqfW_kyZq8][Validation, Communication through Empathy]]
- [[https://new.reddit.com/r/SuicideWatch/wiki/talking_tips/][Talking Tips to talk with someone struggling with suicidal thoughts]]

** Metascience
:PROPERTIES:
:CUSTOM_ID: metascience
:END:

- [[https://scienceintegritydigest.com/2019/07/16/pubpeer-a-website-to-comment-on-scientific-papers/?fbclid=IwZXh0bgNhZW0CMTEAAR19f6V-Yd1EdMu6ary3hQorXZ-9KMfz14qUGMBCMBxFnO_oEQKmbE6fcb0_aem_ASTelQlBB2NMX5t3lvPlZtguDYLXHf-JRFsF0NI1DyNO4heXxoHxVTzRJV4s6f6PvWs92JcupHYi6iXrkeAluv3q][PubPeer - A website to comment on scientific papers]]
- [[https://zettelkasten.de/introduction/][Introduction to the Zettelkasten Method]]
- [[https://github.com/org-roam/org-roam][org-roam - Plain-text Knowledge Management System]]

** Parenting
:PROPERTIES:
:CUSTOM_ID: parenting
:END:

- [[https://www.additudemag.com/autism-learning-disability-symptoms/?fbclid=IwZXh0bgNhZW0CMTEAAR1UsU6mt_n526hn0u7BSsNOfhGfRN0FMVH6WZhrBtjZNFTnRt7YukCXbhs_aem_ASQWpyF8Gg2INpsNCMi50N4r1Jbnbv8kjEE1Jdf9i6LR-PAGM_DFStMH_wGtHyKQULNjAAkMmMqEmczukMPU_qCy][How to differentiate autism from a learning disability - AdditudeMag]]
- [[https://www.theguardian.com/lifeandstyle/2018/jun/30/how-to-survive-teenage-years-parents-guide][How to survive the teenage years: a parents’ guide - The Guardian]]
- [[https://www.psychologytoday.com/us/blog/compassion-matters/201312/are-we-overpraising-our-children][Are we overpraising our children? - Psychology Today]]
- [[https://www.scientificamerican.com/article/novel-finding-reading-literary-fiction-improves-empathy/][Reading Literary Fiction Improves Empathy - Scientific American]]
- [[https://www.medicaldaily.com/how-summer-camp-helps-develop-your-childs-mental-health-and-resilience-246970][How Summer Camp helps develop your child's mental health and resilience - Medical Daily]]
- [[https://kidshealth.org/en/parents/][Resources for Parents - KidsHealth]]
- [[https://www.helloruby.com/][Hello Ruby - Hello Ruby is the world's most whimsical way to learn about computers, technology and programming. [...] It’s suited for kids age 5 years and older...]]
- [[https://www.youtube.com/watch?v=YtvP5A5OHpU][Early Signs of Autism - Video Tutorial]]
- [[https://www.youtube.com/watch?v=ESqfW_kyZq8][Validation, Communication through Empathy]]
- [[https://michaelssorensen.com/how-to-validate-someone-when-you-dont-agree-with-them/][How to validate someone when you don't agree with them?]]

** Relationships
:PROPERTIES:
:CUSTOM_ID: relationships
:END:

- [[https://www.verywellmind.com/how-to-build-a-relationship-based-on-interdependence-4161249#interdependence-is-not-codependence][Interdependence vs Codependence - VeryWellMind]]
- [[https://www.psychologytoday.com/us/blog/compassion-matters/201307/how-your-attachment-style-impacts-your-relationship][How your Attachment Style impacts your relationship? - Psychology Today]]
- [[https://www.youtube.com/watch?v=ESqfW_kyZq8][Validation, Communication through Empathy]]
- [[https://michaelssorensen.com/how-to-validate-someone-when-you-dont-agree-with-them/][How to validate someone when you don't agree with them?]]

** Society
:PROPERTIES:
:CUSTOM_ID: society
:END:

- [[https://hbr.org/2024/04/more-women-work-in-nonprofits-so-why-do-men-end-up-leading-them][More women work in nonprofits, so why do men end up leading them?]]
- [[https://www.youtube.com/watch?v=-hjGgFgnYIA&list=PL8dPuuaLjXtNppY8ZHMPDH5TKK2UpU8Ng][Crash Course - History of Science]]
- [[https://lolitafashion.fandom.com/wiki/Boystyle][Boystyle - Lolita (Rorita) Fashion Wiki]]
- [[https://www.artofmanliness.com/people/relationships/bosom-buddies-a-photo-history-of-male-affection/][Bosom Buddies: A Photo History of Male Affection]]

** Software Development
:PROPERTIES:
:CUSTOM_ID: software-development
:END:

Beginners: 

- [[https://htdp.org/2019-02-24/part_preface.html][How To Design Programs]]
- [[https://learngitbranching.js.org/][Learn Git Branching]]

Intermediate:

- [[https://mamba.readthedocs.io/en/latest/installation/micromamba-installation.html][Micromamba Installation]] - A fast lightweight package manager for conda packages powered by C++
- [[https://github.com/prefix-dev/rattler-build/][rattler-build]] - A fast conda-package builder. Alternative to conda-build


* Books
:PROPERTIES:
:CUSTOM_ID: books
:END:

** Cognitive Science Fundamentals

- Computation and Cognition: Towards a Foundation for Cognitive Science by /Zenon W. Pylyshyn/
- What Computers /Still/ Can't Do: A Critique of Artificial Reason by /Hubert Dreyfus/

