miscellaneous.html

<div id="outline-container-jee" class="outline-3">
<h3 id="jee">JEE</h3>
<div class="outline-text-3" id="text-jee">
<ul class="org-ul">
<li><a href="https://human9being9.wordpress.com/how-to-prepare-for-iit-jee-from-class-6-7-or-8/">How to Prepare for IIT JEE from class 6, 7 or 8?</a></li>
<li><a href="https://human9being9.wordpress.com/how-to-prepare-for-iit-jee-from-class-11-without-coaching/">How to prepare for IIT JEE from class 11th without coaching?</a></li>
<li><a href="https://human9being9.wordpress.com/jee-advanced-unsolved-papers-2013-2016/">IIT JEE / JEE (Advanced) Unsolved Papers (2008-2017)</a></li>
</ul>
</div>
</div>

<div id="outline-container-life" class="outline-3">
<h3 id="life">Life</h3>
<div class="outline-text-3" id="text-life">
<ul class="org-ul">
<li><a href="https://www.cfa.harvard.edu/~ejchaisson/cosmic_evolution/docs/splash.html">Cosmic Evolution: From Big Bang to Humankind</a></li>
<li><a href="https://www.quora.com/What-is-the-most-interesting-fact-you-know-about-Understanding-Life/answer/Vandana-Thakur-99?ch=15&amp;oid=397885467&amp;share=ee834e2f&amp;srid=tWo7&amp;target_type=answer&amp;fbclid=IwZXh0bgNhZW0CMTEAAR34WFhtf2GEQqCrB6-4EyHUvOhx8XybZIoRrLFBqF4WJPMMOsDmerzaCNY_aem_ASSxfdkyPKaZz992hGdRRu22-9-BKQnnHZ0wfigAjJ-s43REo2k_iNBFfJtQ6dcFAtjQrYC3pDsIAQKk9T6iSPIw">How much time do we have with different people in our life?</a>
<ul class="org-ul">
<li><a href="https://waitbutwhy.com/2015/12/the-tail-end.html">The Tail End</a> - A more detailed article that conveys the same points</li>
</ul></li>
<li><a href="https://zettelkasten.de/introduction/">Introduction to the Zettelkasten Method</a>
<ul class="org-ul">
<li><a href="https://github.com/org-roam/org-roam-ui">org-roam-ui - A graphical frontend for exploring your org-roam Zettelkasten</a></li>
</ul></li>
<li><a href="https://www.youtube.com/watch?v=ESqfW_kyZq8">Validation, Communication through Empathy</a></li>
<li><a href="https://michaelssorensen.com/how-to-validate-someone-when-you-dont-agree-with-them/">How to validate someone when you don't agree with them?</a></li>
<li><a href="https://writingcenter.unc.edu/tips-and-tools/fallacies/">Fallacies - This handout discusses common logical fallacies that you may encounter in your own writing or the writing of others.</a></li>
<li><a href="https://lolitafashion.fandom.com/wiki/Boystyle">Boystyle - Lolita (Rorita) Fashion Wiki</a></li>
<li><a href="https://www.youtube.com/watch?v=-hjGgFgnYIA&amp;list=PL8dPuuaLjXtNppY8ZHMPDH5TKK2UpU8Ng">Crash Course - History of Science</a></li>
<li><a href="https://medium.com/the-mission/willpower-doesnt-work-here-s-the-key-to-being-more-productive-according-to-neuroscience-f6c4257eb6b9">Willpower Doesn’t Work. Here’s the Key to Being More Productive According to Neuroscience.</a>
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Implementation_intention">Implementation Intention - Wikipedia</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-mental-health" class="outline-3">
<h3 id="mental-health">Mental Health</h3>
<div class="outline-text-3" id="text-mental-health">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=ESqfW_kyZq8">Validation, Communication through Empathy</a></li>
<li><a href="https://new.reddit.com/r/SuicideWatch/wiki/talking_tips/">Talking Tips to talk with someone struggling with suicidal thoughts</a></li>
</ul>
</div>
</div>

<div id="outline-container-metascience" class="outline-3">
<h3 id="metascience">Metascience</h3>
<div class="outline-text-3" id="text-metascience">
<ul class="org-ul">
<li><a href="https://scienceintegritydigest.com/2019/07/16/pubpeer-a-website-to-comment-on-scientific-papers/?fbclid=IwZXh0bgNhZW0CMTEAAR19f6V-Yd1EdMu6ary3hQorXZ-9KMfz14qUGMBCMBxFnO_oEQKmbE6fcb0_aem_ASTelQlBB2NMX5t3lvPlZtguDYLXHf-JRFsF0NI1DyNO4heXxoHxVTzRJV4s6f6PvWs92JcupHYi6iXrkeAluv3q">PubPeer - A website to comment on scientific papers</a></li>
<li><a href="https://zettelkasten.de/introduction/">Introduction to the Zettelkasten Method</a></li>
<li><a href="https://github.com/org-roam/org-roam">org-roam - Plain-text Knowledge Management System</a></li>
</ul>
</div>
</div>

<div id="outline-container-parenting" class="outline-3">
<h3 id="parenting">Parenting</h3>
<div class="outline-text-3" id="text-parenting">
<ul class="org-ul">
<li><a href="https://www.additudemag.com/autism-learning-disability-symptoms/?fbclid=IwZXh0bgNhZW0CMTEAAR1UsU6mt_n526hn0u7BSsNOfhGfRN0FMVH6WZhrBtjZNFTnRt7YukCXbhs_aem_ASQWpyF8Gg2INpsNCMi50N4r1Jbnbv8kjEE1Jdf9i6LR-PAGM_DFStMH_wGtHyKQULNjAAkMmMqEmczukMPU_qCy">How to differentiate autism from a learning disability - AdditudeMag</a></li>
<li><a href="https://www.theguardian.com/lifeandstyle/2018/jun/30/how-to-survive-teenage-years-parents-guide">How to survive the teenage years: a parents’ guide - The Guardian</a></li>
<li><a href="https://www.psychologytoday.com/us/blog/compassion-matters/201312/are-we-overpraising-our-children">Are we overpraising our children? - Psychology Today</a></li>
<li><a href="https://www.scientificamerican.com/article/novel-finding-reading-literary-fiction-improves-empathy/">Reading Literary Fiction Improves Empathy - Scientific American</a></li>
<li><a href="https://www.medicaldaily.com/how-summer-camp-helps-develop-your-childs-mental-health-and-resilience-246970">How Summer Camp helps develop your child's mental health and resilience - Medical Daily</a></li>
<li><a href="https://kidshealth.org/en/parents/">Resources for Parents - KidsHealth</a></li>
<li><a href="https://www.helloruby.com/">Hello Ruby - Hello Ruby is the world's most whimsical way to learn about computers, technology and programming. [&#x2026;] It’s suited for kids age 5 years and older&#x2026;</a></li>
<li><a href="https://www.youtube.com/watch?v=YtvP5A5OHpU">Early Signs of Autism - Video Tutorial</a></li>
<li><a href="https://www.youtube.com/watch?v=ESqfW_kyZq8">Validation, Communication through Empathy</a></li>
<li><a href="https://michaelssorensen.com/how-to-validate-someone-when-you-dont-agree-with-them/">How to validate someone when you don't agree with them?</a></li>
</ul>
</div>
</div>

<div id="outline-container-relationships" class="outline-3">
<h3 id="relationships">Relationships</h3>
<div class="outline-text-3" id="text-relationships">
<ul class="org-ul">
<li><a href="https://www.verywellmind.com/how-to-build-a-relationship-based-on-interdependence-4161249#interdependence-is-not-codependence">Interdependence vs Codependence - VeryWellMind</a></li>
<li><a href="https://www.psychologytoday.com/us/blog/compassion-matters/201307/how-your-attachment-style-impacts-your-relationship">How your Attachment Style impacts your relationship? - Psychology Today</a></li>
<li><a href="https://www.youtube.com/watch?v=ESqfW_kyZq8">Validation, Communication through Empathy</a></li>
<li><a href="https://michaelssorensen.com/how-to-validate-someone-when-you-dont-agree-with-them/">How to validate someone when you don't agree with them?</a></li>
</ul>
</div>
</div>

<div id="outline-container-society" class="outline-3">
<h3 id="society">Society</h3>
<div class="outline-text-3" id="text-society">
<ul class="org-ul">
<li><a href="https://hbr.org/2024/04/more-women-work-in-nonprofits-so-why-do-men-end-up-leading-them">More women work in nonprofits, so why do men end up leading them?</a></li>
<li><a href="https://www.youtube.com/watch?v=-hjGgFgnYIA&amp;list=PL8dPuuaLjXtNppY8ZHMPDH5TKK2UpU8Ng">Crash Course - History of Science</a></li>
<li><a href="https://lolitafashion.fandom.com/wiki/Boystyle">Boystyle - Lolita (Rorita) Fashion Wiki</a></li>
<li><a href="https://www.artofmanliness.com/people/relationships/bosom-buddies-a-photo-history-of-male-affection/">Bosom Buddies: A Photo History of Male Affection</a></li>
</ul>
</div>
</div>

<div id="outline-container-software-development" class="outline-3">
<h3 id="software-development">Software Development</h3>
<div class="outline-text-3" id="text-software-development">
<p>
Beginners: 
</p>

<ul class="org-ul">
<li><a href="https://htdp.org/2019-02-24/part_preface.html">How To Design Programs</a></li>
<li><a href="https://learngitbranching.js.org/">Learn Git Branching</a></li>
</ul>

<p>
Intermediate:
</p>

<ul class="org-ul">
<li><a href="https://mamba.readthedocs.io/en/latest/installation/micromamba-installation.html">Micromamba Installation</a> - A fast lightweight package manager for conda packages powered by C++</li>
<li><a href="https://github.com/prefix-dev/rattler-build/">rattler-build</a> - A fast conda-package builder. Alternative to conda-build</li>
</ul>
</div>
</div>
</div>
