miscellaneous.html


<div id="outline-container-books" class="outline-2">
<h2 id="books">Books</h2>
<div class="outline-text-2" id="text-books">
<ul class="org-ul">
<li>What the Buddha Taught by <i>Walpola Rahula</i></li>
<li>Sapiens: A brief History of Humankind by <i>Yuval Noah Harari</i></li>
<li>Ender’s Game and its sequel Speaker for the Dead by <i>Orson Scott Card</i></li>
<li>Godel, Escher and Bach: An eternal golden braid by <i>Douglas R. Hofstadter</i></li>
<li>Linear Algebra Done Right by <i>Sheldon Axler</i></li>
<li>The Language Instinct: How the Mind creates language by <i>Steven Pinker</i></li>
<li>The Evolution of Agency: Behavioral Organization from Lizards to Humans by <i>Michael Tomasello</i></li>
<li>The Evolution of the Sensitive Soul: Learning and the Origins of Consciousness by <i>Simona Ginsburg and Eva Jablonka</i></li>
<li>What Computers <i>Still</i> Can't Do: A Critique of Artificial Reason by <i>Hubert Dreyfus</i></li>
</ul>
</div>
</div>

<div id="outline-container-blogs" class="outline-2">
<h2 id="blogs">Blogs</h2>
<div class="outline-text-2" id="text-blogs">
<p>
Some of my Quora answers have been collected <a href="https://human9being9.wordpress.com/my-quora/">here</a>. Most of them were written around 2014, before the decline of the platform began.
</p>

<p>
There's also a <a href="http://human9being9.wordpress.com/">wordpress</a> blog I write on sometimes. Some articles of general interest might include:
</p>

<ul class="org-ul">
<li><a href="https://human9being9.wordpress.com/2022/10/09/whitewashing-persuasion-this-is-what-i-think-is-the-best-for-you-please-do-your-best-to-accept-this-uncertainty-and-choose-what-is-good/">Whitewashing Persuasion: “This is what I think is the best for you, please do your best to accept this uncertainty, and choose what is good.”</a></li>
<li><a href="https://human9being9.wordpress.com/10-things-you-must-know/">10 Things You Must Know</a></li>
<li><a href="https://human9being9.wordpress.com/2020/02/15/dealing-with-loneliness/">Dealing with Loneliness</a></li>
<li><a href="https://human9being9.wordpress.com/2020/02/06/evolving-perspectives-on-actions-and-desires/">Evolving Perspectives on Actions and Desires</a></li>
<li><a href="https://human9being9.wordpress.com/28-2/">Myopia</a></li>
<li><a href="https://human9being9.wordpress.com/2021/06/06/active-learning-with-zettelkasten/">Active Learning &lowast;with Zettelkasten&lowast;</a></li>
</ul>

<p>
Around the end of high school and the beginning of college, I used to wonder if anything could be done to make middle school education less siloed. I ended up with a partly-made (10%?) website - <a href="https://digikar99.github.io/alterschoolindia">alterschoolindia</a> - that aimed at moving from one topic (eg: civics) to a distant another (eg: mathematics) through continuous interactive questioning.
</p>

<ul class="org-ul">
<li>There's also a section on <a href="https://digikar99.github.io/alterschoolindia/intermediate.html">alterschoolindia/intermediate</a>: Some resources on Career Tasting (yes, that's T-A-S-T) - It's less of "Let's see how you perform" and more of "Check for yourself how you like each of these".</li>

<li>I recently ran into a <a href="https://www.lesswrong.com/posts/xg3hXCYQPJkwHyik2/the-best-textbooks-on-every-subject">LessWrong Blog Post on The Best Textbooks on Every Subject</a> that may be of use to some.</li>
</ul>

<p>
Lacking an audience, and perhaps, more importantly, realizing that "useless" school education would be determined by the sociocultural system of a society, I lost the motivation for developing alterschoolindia further. It seems that to decide the school curriculum, one needs some opinions on the sociocultural system of a society &#x2013; hopefully, there exists something more sensible/efficient than the modern democratic systems. Here, by "useless", I mean the modern notion that school education should focus on "useful" skills and knowledge that can actually be applied so that the future citizens can be more productive members of the <del>labour-force</del> society.
</p>
</div>
</div>
</div>
</body>
</html>
